# Chapter7 Data Cleaning and Prepration

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data=pd.Series(['aardvark','artichoke', np.nan,'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0]=None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[string_data.isnull()==True]

0    None
2     NaN
dtype: object

In [9]:
string_data[string_data.isnull()==False]

1    artichoke
3      avocado
dtype: object

In [10]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

### Filtering Out Missing Data

In [11]:
from numpy import nan as NA

In [12]:
data = pd.Series([1, NA, 3.5, NA, 7])

#### dropna() on Series will drop only NA elements

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

#### dropna() on Dataframe dropna by default drops any row containing a missing value

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

#### Giving Threshold =2     "So it won't delete all rows but, row containing less than  two NaN "

In [18]:
data.dropna(thresh=2)

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

#### Column wise use of dropna is possible if we  give axis=1 in argument

In [19]:
data.dropna(axis=1,thresh=2)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

#### how='all'   will only drop rows that are all NA:

In [20]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data[4]=NA

In [22]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
df1=pd.DataFrame(np.random.randn(7,3))

In [25]:
df1

          0         1         2
0 -0.073453 -0.724091  1.663832
1  0.432867 -0.305387 -1.093918
2 -0.586399 -0.832161 -1.361182
3  0.412505  0.380018  0.153819
4 -0.714235 -1.047234 -0.717971
5  0.009788  1.659165 -0.977545
6 -0.296845 -0.382494 -1.544630

In [26]:
df1.iloc[:4,1]=NA

In [27]:
df1.iloc[:2,2]=NA

In [28]:
df1.dropna()

          0         1         2
4 -0.714235 -1.047234 -0.717971
5  0.009788  1.659165 -0.977545
6 -0.296845 -0.382494 -1.544630

In [29]:
df1

          0         1         2
0 -0.073453       NaN       NaN
1  0.432867       NaN       NaN
2 -0.586399       NaN -1.361182
3  0.412505       NaN  0.153819
4 -0.714235 -1.047234 -0.717971
5  0.009788  1.659165 -0.977545
6 -0.296845 -0.382494 -1.544630

In [30]:
df1.dropna(thresh=2)

          0         1         2
2 -0.586399       NaN -1.361182
3  0.412505       NaN  0.153819
4 -0.714235 -1.047234 -0.717971
5  0.009788  1.659165 -0.977545
6 -0.296845 -0.382494 -1.544630

#### Filling In Missing Data

In [31]:
df1.fillna(0)

          0         1         2
0 -0.073453  0.000000  0.000000
1  0.432867  0.000000  0.000000
2 -0.586399  0.000000 -1.361182
3  0.412505  0.000000  0.153819
4 -0.714235 -1.047234 -0.717971
5  0.009788  1.659165 -0.977545
6 -0.296845 -0.382494 -1.544630

In [32]:
df1

          0         1         2
0 -0.073453       NaN       NaN
1  0.432867       NaN       NaN
2 -0.586399       NaN -1.361182
3  0.412505       NaN  0.153819
4 -0.714235 -1.047234 -0.717971
5  0.009788  1.659165 -0.977545
6 -0.296845 -0.382494 -1.544630

In [33]:
df1.fillna({1:0.5,2:0})

          0         1         2
0 -0.073453  0.500000  0.000000
1  0.432867  0.500000  0.000000
2 -0.586399  0.500000 -1.361182
3  0.412505  0.500000  0.153819
4 -0.714235 -1.047234 -0.717971
5  0.009788  1.659165 -0.977545
6 -0.296845 -0.382494 -1.544630

In [34]:
df1

          0         1         2
0 -0.073453       NaN       NaN
1  0.432867       NaN       NaN
2 -0.586399       NaN -1.361182
3  0.412505       NaN  0.153819
4 -0.714235 -1.047234 -0.717971
5  0.009788  1.659165 -0.977545
6 -0.296845 -0.382494 -1.544630

###  Fillna forcing in-place

In [35]:
df1.dropna(0,inplace=True)

In [36]:
df1

          0         1         2
4 -0.714235 -1.047234 -0.717971
5  0.009788  1.659165 -0.977545
6 -0.296845 -0.382494 -1.544630

In [37]:
df2=pd.DataFrame(np.random.randn(6,3))

In [38]:
df2

          0         1         2
0  0.376125  1.603965  0.607586
1 -0.111679  1.495325 -0.973162
2 -0.521255  0.818950 -0.237750
3 -0.461004  0.690158  0.474346
4 -0.495781 -0.692054 -0.480038
5  0.699680 -0.671825 -1.166632

In [39]:
df2.iloc[2:4,1]=NA

In [40]:
df2.iloc[1:5,2]=NA

In [41]:
df2

          0         1         2
0  0.376125  1.603965  0.607586
1 -0.111679  1.495325       NaN
2 -0.521255       NaN       NaN
3 -0.461004       NaN       NaN
4 -0.495781 -0.692054       NaN
5  0.699680 -0.671825 -1.166632

#### interpolation methods available for reindexing can be used with fillna

In [42]:
df2.fillna(method='ffill',limit=2)

          0         1         2
0  0.376125  1.603965  0.607586
1 -0.111679  1.495325  0.607586
2 -0.521255  1.495325  0.607586
3 -0.461004  1.495325       NaN
4 -0.495781 -0.692054       NaN
5  0.699680 -0.671825 -1.166632

### fillna you can do lots of other things with a little creativity

#### 1. pass the mean or median value of a Series:

In [43]:
df2.fillna(df2[1].mean())

          0         1         2
0  0.376125  1.603965  0.607586
1 -0.111679  1.495325  0.433853
2 -0.521255  0.433853  0.433853
3 -0.461004  0.433853  0.433853
4 -0.495781 -0.692054  0.433853
5  0.699680 -0.671825 -1.166632

In [44]:
df2

          0         1         2
0  0.376125  1.603965  0.607586
1 -0.111679  1.495325       NaN
2 -0.521255       NaN       NaN
3 -0.461004       NaN       NaN
4 -0.495781 -0.692054       NaN
5  0.699680 -0.671825 -1.166632

### Data Transformation

#### Removing Duplicate Data

In [45]:
df3=pd.DataFrame({'k1':['two','one']*3+['one'],
                 'k2':[1,1,2,3,3,4,4]})

In [46]:
df3

    k1  k2
0  two   1
1  one   1
2  two   2
3  one   3
4  two   3
5  one   4
6  one   4

#### Duplicated() identifies repeatition in record(row)

In [47]:
df3.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

#### dropduplicates() return dataframe where duplicated returns False [ non repeated values are returned]

In [49]:
df3.drop_duplicates()

    k1  k2
0  two   1
1  one   1
2  two   2
3  one   3
4  two   3
5  one   4

###  specify any subset of them to detect duplicates {find Unique by Rows, by single column, by multiple columns}
##### by default consider all of the columns, but you can identify a particular.

In [60]:
df3['k3'] = range(7)

In [61]:
df3

    k1  k2  k3
0  two   1   0
1  one   1   1
2  two   2   2
3  one   3   3
4  two   3   4
5  one   4   5
6  one   4   6

In [62]:
df3.drop_duplicates(['k2'])

    k1  k2  k3
0  two   1   0
2  two   2   2
3  one   3   3
5  one   4   5

In [63]:
df3.drop_duplicates(['k1','k2'])

    k1  k2  k3
0  two   1   0
1  one   1   1
2  two   2   2
3  one   3   3
4  two   3   4
5  one   4   5

In [66]:
df3.drop_duplicates(['k1','k2','k3'])

    k1  k2  k3
0  two   1   0
1  one   1   1
2  two   2   2
3  one   3   3
4  two   3   4
5  one   4   5
6  one   4   6

df3

#### Passing keep='last' will return the last one: by default keep the first observed value combination.

In [68]:
df3.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  k3
0  two   1   0
1  one   1   1
2  two   2   2
3  one   3   3
4  two   3   4
6  one   4   6

### Transforming Data Using a Function or Mapping

In [74]:
df4=pd.DataFrame({'food':['bacon','pulled pork', 'bacon', 
                          'pastrami', 'corned beef', 'bacon', 'pastrami',
                          'honey ham','nova lox'],
                'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [75]:
df4

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [76]:
meat_to_animal={'bacon': 'pig',
'pulled pork': 'pig','pastrami': 'cow',
'corned beef': 'cow','honey ham': 'pig',
'nova lox': 'salmon'}

In [78]:
df4['animal']=df4['food'].map(meat_to_animal)

In [79]:
df4

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

#### using a maping function

In [83]:
df4['animal 2']=df4.food.map(lambda x: meat_to_animal[x])

In [84]:
df4

          food  ounces  animal animal 2
0        bacon     4.0     pig      pig
1  pulled pork     3.0     pig      pig
2        bacon    12.0     pig      pig
3     pastrami     6.0     cow      cow
4  corned beef     7.5     cow      cow
5        bacon     8.0     pig      pig
6     pastrami     3.0     cow      cow
7    honey ham     5.0     pig      pig
8     nova lox     6.0  salmon   salmon